# T-분포-------------------------------------------------------------------------
# 정규 분포 모집단에서 표본 추출
#--------------------------------------------------------------------------------
t_value=3.98
dt(t_value,df=19)

# 누적값
# 기본값 : <=3.98
pt(t_value, df=19)

# 변경 : >3.98
pt(t_value,df=19,lower.tail = FALSE)

#퍼센트에 해당하는 확률값
qt(0.95,df=19)  #95%
qt(0.5)         #50%
qt(0.25)        #25%
qt(0.05,df=19)  #5%
qt(0.025,df=19) #2.5%


#--------------------------------------------------
# t-분포기반 t-검정
#--------------------------------------------------
#데이터 확인---------------------------------------
library(MASS)
str(cats)

# 귀무가설 : 몸무게는 2.6kg입니다.
h0=2.6
data=cats$Bwt
# 검정
result=t.test(data,mu=h0)
result


# 귀무가설 : 몸무게는 2.7kg 입니다.
h0=2.7
data=cats$Bwt
# 검정
result=t.test(data,mu=h0)
result













