import pandas as pd                 #데이터분석용 패키지
import ex_pandas as sr     #나의 모듈 day_0102\ex_pandas



#--------------------------------------------------------------------------------
#--------------------------------------------------------------------------------
# Series 객체의 요소 다루기 => 인덱스 사용
# 사용법 객체변수명[인덱스]
#--------------------------------------------------------------------------------
data = list(range(5,30,5))
sr1=pd.Series(data)

# 요소1개 읽기 => 변수명[인덱스]
print(f'sr1[0] => {sr1[0]}')
print(f'sr1[5] => {sr1[3]}')

# for idx in range(len(sr1)):
#     print(f'sr1[{idx}] => {sr1[idx]}')


for idx in sr1.index:
    print(f'idx => {idx}')
    print(f'sr1[{idx}] => {sr1[idx]}: {type(sr1[idx])}')

# 요소 여러개 읽기 => 변수명[인덱스1, 인덱스2]------------------------------------------------
# ==> 결과 데이터 시리즈(series)타입
print(f'sr1[[0,4]] => \n{sr1[[0,4]]}\n{type(sr1[[0,4]])}')
print(f'sr1[[4]] => \n{sr1[[4]]}\n{type(sr1[[4]])}')
print(f'sr1[[0,1,2,3,4]] => \n{sr1[[0,1,2,3,4]]}\n{type(sr1[[0,1,2,3,4]])}')


# 요소 범위지정하여 읽기 => 변수명[ 시작: 끝인덱스+1 ] # 인덱싱
print(f'sr1[:5] => \n{sr1[:5]}\n{type(sr1[:5])}')
print(f'sr1[::2] => \n{sr1[::2]}\n{type(sr1[::2])}')




